InformationRegisters/ГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ГАЗЗаявки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Comment>Дата регистрации заявки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Comment>Электронная почта контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Comment>Внешний ID из системы ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГАЗЗаявки/Ext/ManagerModule.bsl
Функция Закрыть(Сигнатура, Окончание) Экспорт
	// Окончание равно дате закрытия последней задачи проверки
	
	Данные = "Сигнатура = "+Сигнатура+"; Окончание = "+Окончание;	
	Результат = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Сигнатура) = Тип("Строка");
	Доступно = Доступно И ТипЗнч(Окончание) = Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(Сигнатура);
	Доступно = Доступно и ЗначениеЗаполнено(Окончание);
	
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Ошибка закрытия Заявки ГАЗ: ошибка в аргументах", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ГАЗЗаявки, Данные);
		Возврат Ложь;
	КонецЕсли;
	
	Зап = РегистрыСведений.ГАЗЗаявки.СоздатьМенеджерЗаписи();
	Зап.Сигнатура = Сигнатура;
	Зап.Прочитать();
	Если Зап.Выбран()=Ложь Тогда
		ЗаписьЖурналаРегистрации("Ошибка закрытия Заявки ГАЗ: не выбрана запись", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ГАЗЗаявки, Данные);
		Возврат Ложь;
	КонецЕсли;
	Зап.Окончание = Окончание;
	Попытка
		Зап.Записать();
		Результат = Истина;
	Исключение
		Данные = "Сигнатура = "+Сигнатура+"; Окончание = "+Окончание;
		ЗаписьЖурналаРегистрации("Ошибка закрытия Заявки ГАЗ", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ГАЗЗаявки, Данные, ОписаниеОшибки());
		Результат = Ложь;
	КонецПопытки;
	Возврат Результат;	
КонецФункции
